#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.terraform_remote_state.rds: Reading...
data.aws_vpc.vpc: Reading...
data.aws_iam_role.labrole: Reading...
data.aws_iam_role.labrole: Read complete after 1s [id=LabRole]
data.terraform_remote_state.rds: Read complete after 1s
data.aws_vpc.vpc: Read complete after 1s [id=vpc-08b5d48eb5f8b0e3e]
data.aws_subnets.subnets: Reading...
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.subnet["subnet-031786b9128aef99f"]: Reading...
data.aws_subnet.subnet["subnet-0f9dae0f12ffc0a97"]: Reading...
data.aws_subnet.subnet["subnet-061dd3c089f8a166e"]: Reading...
data.aws_subnet.subnet["subnet-08fb4e2031af2aafd"]: Reading...
data.aws_subnet.subnet["subnet-0c57f393cb8b519d6"]: Reading...
data.aws_subnet.subnet["subnet-0ea76061fe175c236"]: Reading...
data.aws_subnet.subnet["subnet-031786b9128aef99f"]: Read complete after 0s [id=subnet-031786b9128aef99f]
data.aws_subnet.subnet["subnet-0ea76061fe175c236"]: Read complete after 0s [id=subnet-0ea76061fe175c236]
data.aws_subnet.subnet["subnet-08fb4e2031af2aafd"]: Read complete after 0s [id=subnet-08fb4e2031af2aafd]
data.aws_subnet.subnet["subnet-0f9dae0f12ffc0a97"]: Read complete after 0s [id=subnet-0f9dae0f12ffc0a97]
data.aws_subnet.subnet["subnet-0c57f393cb8b519d6"]: Read complete after 0s [id=subnet-0c57f393cb8b519d6]
data.aws_subnet.subnet["subnet-061dd3c089f8a166e"]: Read complete after 0s [id=subnet-061dd3c089f8a166e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_access_entry.access-entry will be created
  + resource "aws_eks_access_entry" "access-entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "tech-challenge-lanchonete"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "fiap",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::214755515331:role/voclabs"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.eks-policy will be created
  + resource "aws_eks_access_policy_association" "eks-policy" {
      + associated_at = (known after apply)
      + cluster_name  = "tech-challenge-lanchonete"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::214755515331:role/voclabs"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_cluster.eks-cluster will be created
  + resource "aws_eks_cluster" "eks-cluster" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "tech-challenge-lanchonete"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::214755515331:role/LabRole"
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = (known after apply)

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-061dd3c089f8a166e",
              + "subnet-08fb4e2031af2aafd",
              + "subnet-0c57f393cb8b519d6",
              + "subnet-0ea76061fe175c236",
              + "subnet-0f9dae0f12ffc0a97",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.node-group will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "tech-challenge-lanchonete"
      + disk_size              = 50
      + id                     = (known after apply)
      + instance_types         = [
          + "t3a.medium",
        ]
      + node_group_name        = "NG-tech-challenge-lanchonete"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::214755515331:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-061dd3c089f8a166e",
          + "subnet-08fb4e2031af2aafd",
          + "subnet-0c57f393cb8b519d6",
          + "subnet-0ea76061fe175c236",
          + "subnet-0f9dae0f12ffc0a97",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "EKS Cluster Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow outbound traffic to RDS"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "SG-tech-challenge-lanchonete"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-08b5d48eb5f8b0e3e"
    }

  # aws_security_group_rule.eks_to_rds will be created
  + resource "aws_security_group_rule" "eks_to_rds" {
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-01359e57faa818fc5"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @anadezuo, Action: `pull_request`*